window.QIMEN_KE_YING = {
  "gan": {
    "乙乙": {
      "name": "日奇伏吟",
      "text": "不宜见上级领导、贵人；求名利及进取事不可求，宜安分守己。"
    },
    "乙丙": {
      "name": "奇仪顺遂",
      "text": "吉星加官晋职，凶星夫妻反目离别"
    },
    "乙丁": {
      "name": "奇仪相佐",
      "text": "最利文书、考试，百事可为。"
    },
    "乙戊": {
      "name": "阴害阳门",
      "text": "利于阴人阴事，不利于阳人阳事，"
    },
    "乙己": {
      "name": "日奇入墓",
      "text": "被土暗昧、门凶事必凶，门吉有救"
    },
    "乙庚": {
      "name": "日奇被刑",
      "text": "为争讼财产，夫妻各怀私意。"
    },
    "乙辛": {
      "name": "青龙逃走",
      "text": "人亡财破，奴仆拐带，六畜皆伤。"
    },
    "乙壬": {
      "name": "日奇入天罗",
      "text": "尊卑悖乱，官讼是非，有人谋害。"
    },
    "乙癸": {
      "name": "日奇入地网",
      "text": "宜退不宜进，隐匿藏形，躲灾避难为吉，不宜进攻。"
    },
    "丙乙": {
      "name": "日月并行",
      "text": "⽇⽉并⾏，公谋私就皆为吉。"
    },
    "丙丙": {
      "name": "月奇悖师",
      "text": "⽂书逼迫，破耗遗失，主单据、票证，不明遗失。"
    },
    "丙丁": {
      "name": "星奇朱雀",
      "text": "贵⼈⽂书吉利，常⼈平静安乐，得三吉门为天遁。"
    },
    "丙戊": {
      "name": "飞鸟跌穴",
      "text": "事业可为，可谋大事，门凶事凶"
    },
    "丙己": {
      "name": "火悖入刑",
      "text": "囚⼈刑杖，⽂书不⾏，\n吉门得吉，凶门转凶。"
    },
    "丙庚": {
      "name": "荧入太白",
      "text": "贼必去，门户破败，\n盗贼耗失，事业亦凶。"
    },
    "丙辛": {
      "name": "日月相会",
      "text": "谋事成就，病⼈不凶。"
    },
    "丙壬": {
      "name": "火入天罗",
      "text": "为客不利，是⾮颇多。\n静守退让为吉。"
    },
    "丙癸": {
      "name": "月奇入地网",
      "text": "阴⼈害事，灾祸频⽣，凡事暗昧不明。"
    },
    "丁乙": {
      "name": "人遁吉格",
      "text": "贵人加官进爵，常人婚姻财帛有喜。"
    },
    "丁丙": {
      "name": "星随月转",
      "text": "贵人越级高升，常人乐极生悲。"
    },
    "丁丁": {
      "name": "星奇入太阴",
      "text": "喜事从心、万事如意，文书即至。"
    },
    "丁戊": {
      "name": "青龙转光",
      "text": "官人升迁，常人威昌。"
    },
    "丁己": {
      "name": "火入勾陈",
      "text": "奸私仇怨，事因女人。"
    },
    "丁庚": {
      "name": "星奇受阻",
      "text": "文书阻隔，行人必归。"
    },
    "丁辛": {
      "name": "朱雀入狱",
      "text": "罪人失囚，官人失位。"
    },
    "丁壬": {
      "name": "奇仪相合",
      "text": "贵人恩诏，诉狱公平。"
    },
    "丁癸": {
      "name": "朱雀投江",
      "text": "文书口舌是非，经官动府、词诉不利，音信沉溺不到。"
    },
    "戊乙": {
      "name": "青龙和会",
      "text": "门吉事吉，门凶事凶。"
    },
    "戊丙": {
      "name": "青龙返首",
      "text": "动作大吉，若逢门迫、入墓、击刑，则吉事成凶。"
    },
    "戊丁": {
      "name": "青龙耀明",
      "text": "宜见上级、贵人，求功名，为事吉利，若值墓迫，招惹是非。"
    },
    "戊戊": {
      "name": "名为伏吟",
      "text": "凡事不利，道路闭塞，以守为好。"
    },
    "戊己": {
      "name": "贵人入狱",
      "text": "公私不利"
    },
    "戊庚": {
      "name": "值符飞宫",
      "text": "吉事不吉，凶事更凶，求财没利益，测病也主凶。"
    },
    "戊辛": {
      "name": "青龙折足",
      "text": "吉门有生助，尚能谋事；若逢凶门，主招灾，失财或有足疾、折伤。"
    },
    "戊壬": {
      "name": "青龙入天牢",
      "text": "凡阴阳事皆不吉利。"
    },
    "戊癸": {
      "name": "青龙华盖",
      "text": "逢吉门，招福临门；逢凶门，事多不利。"
    },
    "己乙": {
      "name": "墓神不明",
      "text": "地户逢星，宜遁迹隐形为利。"
    },
    "己丙": {
      "name": "火悖地户",
      "text": "男人冤冤相害；阴人必致淫污"
    },
    "己丁": {
      "name": "朱雀入狱",
      "text": "文状词讼，先曲后直。"
    },
    "己戊": {
      "name": "犬遇青龙",
      "text": "门吉为谋望遂意，上人见喜。门凶，枉费心机。"
    },
    "己己": {
      "name": "地户逢鬼",
      "text": "病者发凶或必死，百事不遂，暂不谋为，谋为则凶。"
    },
    "己庚": {
      "name": "刑格返名",
      "text": "词讼先动者不利，如临阴星则有谋害之情。"
    },
    "己辛": {
      "name": "游魂入墓",
      "text": "易招阴邪⿁魅作祟。"
    },
    "己壬": {
      "name": "地网高张",
      "text": "狡童佚⼥，奸情伤杀，凡事不吉，谋为不利。"
    },
    "己癸": {
      "name": "地刑玄武",
      "text": "男⼥疾病垂危，有囚狱词讼之灾。"
    },
    "庚乙": {
      "name": "太白逢星",
      "text": "退吉进凶，谋为不利。"
    },
    "庚丙": {
      "name": "太白入荧",
      "text": "贼必来，为客进利，为主破财。"
    },
    "庚丁": {
      "name": "亭亭之格",
      "text": "因私匿或男⼥关系起官司是⾮，门吉有救，门凶事必凶。"
    },
    "庚戊": {
      "name": "天乙伏宫",
      "text": "百事不可谋，大凶。"
    },
    "庚己": {
      "name": "官府刑格",
      "text": "主有官司⼝⾆，因官讼被判刑，百事不利。"
    },
    "庚庚": {
      "name": "太白同宫",
      "text": "战格，官灾横祸。"
    },
    "庚辛": {
      "name": "白虎干格",
      "text": "不宜远⾏，远⾏车折马伤。"
    },
    "庚壬": {
      "name": "移荡小格",
      "text": "远⾏迷失道路，男⼥⾳信难通。"
    },
    "庚癸": {
      "name": "移荡大格",
      "text": "多主车祸，⾏⼈不⾄，官司不⽌，⽣育母⼦具伤，婚姻易鳏寡孤独。"
    },
    "辛乙": {
      "name": "白虎猖狂",
      "text": "家败人亡，出行有惊恐，远行灾殃，尊长不喜，车船俱伤。"
    },
    "辛丙": {
      "name": "干合悖师",
      "text": "占⾬⽆，占晴旱，占事因财致讼。门吉⽆事;门凶事凶。"
    },
    "辛丁": {
      "name": "狱神得奇",
      "text": "求财获利倍增，囚⼈天赦释免，"
    },
    "辛戊": {
      "name": "困龙被伤",
      "text": "主官司破财，妄动招灾破财。"
    },
    "辛己": {
      "name": "入狱自刑",
      "text": "主奴仆背主，有苦诉讼难伸。"
    },
    "辛庚": {
      "name": "白虎出力",
      "text": "⼑刃相交，主客相残，逊让退步则安，强进⾎溅⾐衫。"
    },
    "辛辛": {
      "name": "伏吟天庭",
      "text": "公废私就，讼狱⾃罹罪名。"
    },
    "辛壬": {
      "name": "凶蛇入狱",
      "text": "两男争⼥，⼀货售两家、讼狱不息，先动失理，利主不利客。"
    },
    "辛癸": {
      "name": "天牢华盖",
      "text": "⽇⽉失明，误⼊天⽹，动⽌乖张。"
    },
    "壬乙": {
      "name": "小蛇得势",
      "text": "女人柔顺，男人通达。测孕生子，禄马光华。"
    },
    "壬丙": {
      "name": "水蛇入火",
      "text": "官灾刑禁，络绎不绝，两败俱伤，为客不利。"
    },
    "壬丁": {
      "name": "干合蛇刑",
      "text": "⽂书牵连，贵⼈匆匆，男吉⼥凶。"
    },
    "壬戊": {
      "name": "小蛇化龙",
      "text": "男⼈发达，⼥产婴童。"
    },
    "壬己": {
      "name": "反吟蛇刑",
      "text": "官司败诉，⼤祸将⾄，顺守为吉，妄动必凶。"
    },
    "壬庚": {
      "name": "太白擒蛇",
      "text": "刑狱公平，⽴判邪正"
    },
    "壬辛": {
      "name": "螣蛇相缠",
      "text": "纵得吉门，亦不能安。如有谋望，被⼈欺骗。"
    },
    "壬壬": {
      "name": "天狱自刑",
      "text": "诸事主破败，外事缠绕，内事索索。"
    },
    "壬癸": {
      "name": "幼女奸淫",
      "text": "家丑外扬，门吉星凶，反福为祸。"
    },
    "癸乙": {
      "name": "华盖逢星",
      "text": "贵人禄位，常人平安。"
    },
    "癸丙": {
      "name": "华盖悖师",
      "text": "贵贱逢之不利，唯上人见喜。"
    },
    "癸丁": {
      "name": "螣蛇夭矫",
      "text": "文书官司，火焚难逃，合作必散伙。"
    },
    "癸戊": {
      "name": "天乙和会",
      "text": "吉门利求财，婚姻，合作。若门凶迫制，反祸官非。"
    },
    "癸己": {
      "name": "华盖地户",
      "text": "音信皆阻，躲灾避难方为吉。"
    },
    "癸庚": {
      "name": "太白入网",
      "text": "暴力争讼，自罗罪责。"
    },
    "癸辛": {
      "name": "网盖天牢",
      "text": "官司败诉，死罪难逃。测病，亦大凶。"
    },
    "癸壬": {
      "name": "复见螣蛇",
      "text": "嫁娶重婚，后嫁无子，不保年华。"
    },
    "癸癸": {
      "name": "天网四张",
      "text": "行人失伴，病讼皆伤。"
    }
  },
  "door": {
    "开加开": "主贵人宝物财喜。",
    "开加休": "主见贵人财喜及开张铺店，贸易大利。",
    "开加生": "主见贵人，谋望所求遂意。",
    "开加伤": "主变动、更改、移徒，事皆不吉。",
    "开加杜": "主失脱，刊印书契小凶。",
    "开加景": "主见贵人，因文书不利。",
    "开加死": "主官司惊扰，先忧后喜。",
    "开加惊": "主百事不利。",
    "开加戊": "财名俱得。",
    "开加乙": "小财可求。",
    "开加丙": "贵人印绶。",
    "开加丁": "远信必至。",
    "开加己": "事绪不定。",
    "开加庚": "道路词讼，谋为两岐。",
    "开加辛": "阴人道路。",
    "开加壬": "远行有失，注意破财。",
    "开加癸": "阴人失财小凶。",
    "休加休": "求财、进人口、谒贵吉，上任、修造亦大利。",
    "休加生": "主得阴人财物，谒贵谋望，虽迟也吉。",
    "休加伤": "上官喜庆，求财不得，有亲戚分产。变动事不吉。",
    "休加杜": "主破财，失物难寻。",
    "休加景": "主求文书印信事不至，反招口舌小凶。",
    "休加死": "主文印官司事不吉，远行，僧道事不吉，占病凶。",
    "休加惊": "主损财、招非并疾病、惊恐事。",
    "休加开": "主开张店铺及见贵、求财等喜事，大吉。",
    "休加戊": "财物和合。",
    "休加乙": "求谋重，不得；求轻，可得。",
    "休加丙": "文书和合喜庆。",
    "休加丁": "百讼休歇。",
    "休加己": "暗昧不宁，后吉。",
    "休加庚": "文书词讼先结后解。",
    "休加辛": "疾病迟愈，失物不得。",
    "休加壬": "阴人词讼牵连。",
    "休加癸": "阴人词讼牵连。",
    "生加生": "主远行、求财吉。",
    "生加伤": "主亲友变动，道路不吉。",
    "生加杜": "主阴谋，阴人破财，不利。",
    "生加景": "主阴人、小口不宁及文书事，后吉。",
    "生加死": "主田宅官司，病主难救。",
    "生加惊": "主尊长财产、词讼，病迟愈，吉。",
    "生加开": "主见贵人，求财大发。",
    "生加休": "主阴人处求谋财利，吉。",
    "生加戊": "嫁娶、求财、谒贵皆吉。",
    "生加乙": "主阴人生产，迟吉。",
    "生加丙": "主贵人印绶、婚姻、书信喜事。",
    "生加丁": "主词讼、婚姻、财利大吉。",
    "生加己": "主得贵人维持，吉。",
    "生加庚": "主财产争讼破产，不利。",
    "生加辛": "主产妇疾病，后吉。",
    "生加壬": "主遗失财后得，贼盗易获。",
    "生加癸": "主婚姻不成，余事皆吉。",
    "伤加伤": "主变动，远行折伤，凶。",
    "伤加杜": "主变动，失脱，官司，桎梏，百事凶。",
    "伤加景": "主文书印信，口舌，惹是生非。",
    "伤加死": "主官司印信凶，出行大忌，占病凶。",
    "伤加惊": "主亲人疾病忧惊，媒伐不利，凶。",
    "伤加开": "主见贵人、开张、走失、变动之事，不利。",
    "伤加休": "主男人变动或托人办事，财名不利。",
    "伤加生": "主房产、种植事业，凶。",
    "伤加戊": "主失脱难获。",
    "伤加乙": "主求谋不得，反防盜失财。",
    "伤加丙": "主道路损失。",
    "伤加丁": "主音信不至。",
    "伤加己": "主财散人病。",
    "伤加庚": "主讼狱被刑杖，凶。",
    "伤加辛": "主夫妻怀私恣怨。",
    "伤加壬": "主因盗牵连。",
    "伤加癸": "主讼狱被冤，有理难伸。",
    "杜加杜": "主因父母疾病、田宅出脱事，凶。",
    "杜加景": "主文书印信阻隔，男人小口疾病，迟疑不利。",
    "杜加死": "主田宅文书失落，官司破财，小凶。",
    "杜加惊": "主门户内忧疑惊恐，并有词讼事。",
    "杜加开": "主见贵人官长，谋事主先破己财，后吉。",
    "杜加休": "主求财有益。",
    "杜加生": "主男人小口破财，田宅求财不利。",
    "杜加伤": "主兄弟相争，破财不利。",
    "杜加戊": "主谋事不成，秘处求财得。",
    "杜加乙": "宜暗求男人财物，后主不明致讼。",
    "杜加丙": "主文契遗失。",
    "杜加丁": "主男人讼狱。",
    "杜加己": "主私谋害人招非。",
    "杜加庚": "主因女人讼狱被刑。",
    "杜加辛": "主打伤人，词讼，男人小口凶。",
    "杜加壬": "主奸盜事，凶。",
    "杜加癸": "主百事皆阻，病者不食。",
    "景加景": "主文状未动有预先见之意，内有男人小口忧患。",
    "景加死": "主官讼，因田宅事相争，惹麻烦。",
    "景加惊": "主官讼，女人小口疾病，凶。",
    "景加开": "主官人升迁，吉；求文印更吉。",
    "景加休": "主文书遗失，争讼不休。",
    "景加生": "主阴人生产大喜，更主求财旺利，行人皆吉。",
    "景加伤": "主姻亲小口口舌。",
    "景加杜": "主失脱文书，败财后平。",
    "景加戊": "因财产词讼，远行吉。",
    "景加乙": "主讼事不成。",
    "景加丙": "主文书急迫，火速不利。",
    "景加丁": "主因文书印状招非。",
    "景加己": "主官司牵连。",
    "景加庚": "主讼人自讼。",
    "景加辛": "主阴人词讼。",
    "景加壬": "主因贼牵连。",
    "景加癸": "主因奴婢受刑。",
    "死加死": "主官事稽留，印信无气，凶。",
    "死加惊": "主因管司不结，忧疑患病，凶。",
    "死加开": "主见贵人，求印信文书事大利。",
    "死加休": "主求财物事不吉，若问僧道求方吉。",
    "死加生": "主丧事，求财得，占病死而复生。",
    "死加伤": "主官司动而被刑杖，凶。",
    "死加杜": "主破财，妇人风疾，腹肿。",
    "死加景": "主因文契印信财产事见官，先怒后喜，不凶。",
    "死加戊": "主作伪财。",
    "死加乙": "主求事不成。",
    "死加丙": "主信息忧疑。",
    "死加丁": "主老阳人疾病。",
    "死加己": "主病讼牵连不已，凶。",
    "死加庚": "主女人生产，母子俱凶。",
    "死加辛": "主盗贼失脱难获。",
    "死加壬": "主讼人自讼自招。",
    "死加癸": "主妇女嫁娶事凶。",
    "惊加惊": "主疾病，忧虑，惊恐。",
    "惊加开": "主官司忧疑，能见贵人不凶。",
    "惊加休": "主求财事或口舌事，迟吉。",
    "惊加生": "主因妇人生产或求财事惊忧，皆吉。",
    "惊加伤": "主因商议同谋害人，事泄惹讼，凶。",
    "惊加杜": "主因失脱破财惊恐，不凶。",
    "惊加景": "主词讼不息，小口疾病，凶。",
    "惊加死": "主因宅中怪异而生是非，凶。",
    "惊加戊": "主损财，信阻。",
    "惊加乙": "主谋财不得。",
    "惊加丙": "主文书印信惊恐。",
    "惊加丁": "主词讼牵连。",
    "惊加己": "主恶犬伤人成讼。",
    "惊加庚": "主道路损折，遇贼盗，凶。",
    "惊加辛": "主女人成讼，凶。",
    "惊加壬": "主官司囚禁，病者大凶。",
    "惊加癸": "主被盗，失物难获。"
  }
};
